Historiske data har vi kun pr 1. januar. Det vil sige at vi tager 1 kvartals tallet for de nye data.

In [114]:
import requests
import pandas as pd

# Retrieves population data from all municipalities

## Defining calls to Statistic Denmark API
# 2008 to date
FOLK1A = 'https://api.statbank.dk/v1/data/FOLK1A/CSV?valuePresentation=CodeAndValue&OMR%C3%85DE=*&Tid=*'

# 2005 to 2009
BEF1A07 = "https://api.statbank.dk/v1/data/BEF1A07/CSV?valuePresentation=CodeAndValue&OMR%C3%85DE=*&Tid=*"

# 1979 to 2006
BEF1A = "https://api.statbank.dk/v1/data/BEF1A/CSV?valuePresentation=CodeAndValue&OMR%C3%85DE=*&Tid=*"

# Retrieving data
FOLK1A_data = pd.read_csv(FOLK1A, sep = ";")
BEF1A07_data = pd.read_csv(BEF1A07, sep = ";")
BEF1A_data = pd.read_csv(BEF1A, sep = ";")

In [115]:
# cleaning the data
# FOLK1A needs additional step

def clean_pop_data(df):
    df['muni_code'] = df['OMRÅDE'].str.extract(r'(\d{3})')   # extracting municipality code
    df['muni_name'] = df['OMRÅDE'].str.extract(r'(\d{3}\s+(.*))')[1] # extracting municipalit name
    df['year'] = df['TID'].str.split().str[0]
    df = df\
        .drop(columns=["OMRÅDE", 'TID'])\
        .rename(columns={'INDHOLD':'pop'})
    return df

FOLK1A_data = clean_pop_data(FOLK1A_data)
BEF1A_data = clean_pop_data(BEF1A_data)
BEF1A07_data = clean_pop_data(BEF1A07_data)

In [119]:
# additional cleaning of FOLK1A data
FOLK1A_data = FOLK1A_data[FOLK1A_data['year'].str.endswith('1')]
FOLK1A_data['year'] = FOLK1A_data['year'].str.replace('K1', "")

          pop muni_code    muni_name  year
0     5475791       000  Hele landet  2008
4     5511451       000  Hele landet  2009
8     5534738       000  Hele landet  2010
12    5560628       000  Hele landet  2011
16    5580516       000  Hele landet  2012
...       ...       ...          ...   ...
6596   215312       851      Aalborg  2019
6600   217075       851      Aalborg  2020
6604   219487       851      Aalborg  2021
6608   221082       851      Aalborg  2022
6612   222571       851      Aalborg  2023

[1680 rows x 4 columns]

consolidating the population data

        pop muni_code muni_name  year
6363  28753       840    Rebild  2008

       pop muni_code muni_name  year
508  28753       840    Rebild  2008